DATA AGGREGATION: FILTERING, SORTING, GROUPING

In [10]:
import pandas as pd 

# dataframe with sample data:
data = pd.DataFrame({'Name': ["Nukul", "Linisha", "Naman", "Vicky", "Gaurang", "Akshat"],
'Age': [21, 19, 18, 23, 35, 22],
'Salary': [20000, 60000, 10000, 22000, 25000, 16000],
'Department': ["Tech", "Healthcare", "Tech", "Marketing", "Sales", "Tech"]})

print(data)

      Name  Age  Salary  Department
0    Nukul   21   20000        Tech
1  Linisha   19   60000  Healthcare
2    Naman   18   10000        Tech
3    Vicky   23   22000   Marketing
4  Gaurang   35   25000       Sales
5   Akshat   22   16000        Tech

In [4]:
#  ascending: smallest values at the top and values increasing 
data.sort_values(by = 'Salary', ascending = True)

      Name  Age  Salary  Department
2    Naman   18   10000        Tech
5   Akshat   22   16000       Teech
0    Nukul   21   20000        Tech
3    Vicky   23   22000   Marketing
4  Gaurang   35   25000       Sales
1  Linisha   19   60000  Healthcare

In [6]:
data .sort_values(by = 'Salary', ascending = False)

      Name  Age  Salary  Department
1  Linisha   19   60000  Healthcare
4  Gaurang   35   25000       Sales
3    Vicky   23   22000   Marketing
0    Nukul   21   20000        Tech
5   Akshat   22   16000       Teech
2    Naman   18   10000        Tech

In [12]:
# grouping
print(data.groupby("Department").count())

            Name  Age  Salary
Department
Healthcare     1    1       1
Marketing      1    1       1
Sales          1    1       1
Tech           3    3       3

In [13]:
print(data.groupby("Department")["Salary"].mean())

Department
Healthcare    60000.000000
Marketing     22000.000000
Sales         25000.000000
Tech          15333.333333
Name: Salary, dtype: float64

In [18]:
print(data.groupby("Department")["Salary"].min())
print(data.groupby("Department")["Salary"].max())
print(data.groupby("Department")["Age"].max())
print(data.groupby("Department")["Age"].min())

Department
Healthcare    60000
Marketing     22000
Sales         25000
Tech          10000
Name: Salary, dtype: int64
Department
Healthcare    60000
Marketing     22000
Sales         25000
Tech          20000
Name: Salary, dtype: int64
Department
Healthcare    19
Marketing     23
Sales         35
Tech          22
Name: Age, dtype: int64
Department
Healthcare    19
Marketing     23
Sales         35
Tech          18
Name: Age, dtype: int64

In [19]:
# filtering
print(data[(data["Salary"] > 10000) & (data["Salary"]< 60000)])

      Name  Age  Salary Department
0    Nukul   21   20000       Tech
3    Vicky   23   22000  Marketing
4  Gaurang   35   25000      Sales
5   Akshat   22   16000       Tech

In [23]:
print(data[data["Age"].isin([19,35])])

      Name  Age  Salary  Department
1  Linisha   19   60000  Healthcare
4  Gaurang   35   25000       Sales